blog-api/app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "second修正"], ["content", "second修正"], ["updated_at", "2023-09-18 07:00:49.854557"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)